# ALTER BASICSC

#### Connect to database

In [ ]:
# !pip install sqlalchemy==1.3.9
# !pip install ibm_db_sa

In [2]:
%load_ext sql
%sql ibm_db_sa://mgr61801:aG6rnocuLnVjRZCo@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb?security=SSL

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: mgr61801@bludb'

## Add new columns to the database

In [8]:
%%sql
-- Syntax to add new column to the table
alter table testtable1
add column mobile bigint  ;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [14]:
%%sql
-- Syntax to add new column to the table setting default and not null
ALTER TABLE testtable1
ADD COLUMN mobile2 BIGINT NOT NULL DEFAULT 20;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [15]:
%sql select * from testtable1

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[(1, 'sanket', 'prada', 'waghya', 'jigar', None, 1, 20),
 (2, 'sanket1', 'prada1', 'waghya1', 'jigar1', None, 1, 20),
 (3, '7IMF7', '8NMTC', 'XCL66', 'KZUD3', None, 1, 20),
 (4, 'GY4T8', 'PC4SI', 'XRTSK', 'Y0O4J', None, 1, 20),
 (5, '5DNIQ', 'FKIZT', 'Q63GC', 'CS4MF', None, 1, 20),
 (6, 'Q0SCT', 'BBLTU', 'WFD5R', 'PJHQU', None, 1, 20),
 (7, '31ULI', '66BKA', 'M3ESZ', 'XKFD5', None, 1, 20)]

## TO CHANGE THE DATA TYPE OF EXISTING COLUMN

In [17]:
%%sql
-- Syntax to add new column to the table setting default and not null
ALTER TABLE testtable1
ALTER COLUMN mobile2 SET DATA TYPE CHAR(20);

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [18]:
%sql select * from testtable1

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[(1, 'sanket', 'prada', 'waghya', 'jigar', None, 1, '20                  '),
 (2, 'sanket1', 'prada1', 'waghya1', 'jigar1', None, 1, '20                  '),
 (3, '7IMF7', '8NMTC', 'XCL66', 'KZUD3', None, 1, '20                  '),
 (4, 'GY4T8', 'PC4SI', 'XRTSK', 'Y0O4J', None, 1, '20                  '),
 (5, '5DNIQ', 'FKIZT', 'Q63GC', 'CS4MF', None, 1, '20                  '),
 (6, 'Q0SCT', 'BBLTU', 'WFD5R', 'PJHQU', None, 1, '20                  '),
 (7, '31ULI', '66BKA', 'M3ESZ', 'XKFD5', None, 1, '20                  ')]

## To drop a column or delete a column

In [21]:
%%sql
alter table testtable1
drop column mobile1;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [22]:
%sql select * from testtable1

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[(1, 'sanket', 'prada', 'waghya', 'jigar', None, '20                  '),
 (2, 'sanket1', 'prada1', 'waghya1', 'jigar1', None, '20                  '),
 (3, '7IMF7', '8NMTC', 'XCL66', 'KZUD3', None, '20                  '),
 (4, 'GY4T8', 'PC4SI', 'XRTSK', 'Y0O4J', None, '20                  '),
 (5, '5DNIQ', 'FKIZT', 'Q63GC', 'CS4MF', None, '20                  '),
 (6, 'Q0SCT', 'BBLTU', 'WFD5R', 'PJHQU', None, '20                  '),
 (7, '31ULI', '66BKA', 'M3ESZ', 'XKFD5', None, '20                  ')]

In [25]:
%%sql
alter table testtable1
drop column mobile 
drop column name3;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [27]:
%sql select * from testtable1

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[(1, 'sanket', 'prada', 'waghya', '20                  '),
 (2, 'sanket1', 'prada1', 'waghya1', '20                  '),
 (3, '7IMF7', '8NMTC', 'XCL66', '20                  '),
 (4, 'GY4T8', 'PC4SI', 'XRTSK', '20                  '),
 (5, '5DNIQ', 'FKIZT', 'Q63GC', '20                  '),
 (6, 'Q0SCT', 'BBLTU', 'WFD5R', '20                  '),
 (7, '31ULI', '66BKA', 'M3ESZ', '20                  ')]

In [29]:
## import table to csv
import pandas as pd
from sqlalchemy import create_engine

In [30]:
cnx = create_engine('ibm_db_sa://mgr61801:aG6rnocuLnVjRZCo@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb?security=SSL').connect()

In [31]:
testtable1df = pd.read_sql_table('testtable1', cnx )

In [33]:
testtable1df.to_csv("testtable1.csv")

## drop table

In [43]:
%%sql
drop table testtable1;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]